## Python database connectivity and performing manipulations

#### 1- Importing Libraries and establishing database connection
SQLAlchemy Connection Strings : https://docs.sqlalchemy.org/en/14/core/engines.html

In [1]:
import pandas as pd
import sqlalchemy

In [2]:
engine = sqlalchemy.create_engine('postgresql://username:password@localhost/db_name')

In [4]:
engine

Engine(postgresql://postgres:***@localhost/formapp)

#### 2- Reading the data from table

In [6]:
student_details = pd.read_sql_table("student_details",engine)

In [7]:
student_details

    name  roll_no  class gender blood_group    phone
0    Tom       44      7      M           O   997755
1   Jake       31      7      M           A   887755
2  Kelly       27      7      F          AB   589077
3  Varun       46      8      M           O   896876
4   Adil        6      8      M           B  3404532
5  Emily       17      7      F           B   342411

#### 3- Read data as query

In [8]:
query = '''select * from student_details a join student_marks b 
              ON (a.class=b.class and a.roll_no=b.roll_no)'''

In [9]:
df = pd.read_sql_query(query,engine)
df

,name,roll_no,class,gender,blood_group,phone,class,roll_no,science,maths,english
0,Emily,17,7,F,B,342411,7,17,67,89,59
1,Kelly,27,7,F,AB,589077,7,27,64,45,32
2,Jake,31,7,M,A,887755,7,31,67,55,77
3,Tom,44,7,M,O,997755,7,44,91,85,78
4,Adil,6,8,M,B,3404532,8,6,45,22,67
5,Varun,46,8,M,O,896876,8,46,46,55,87

In [11]:
df1 = pd.read_sql("student_marks",engine)
df1

   class  roll_no  science  maths  english
0      7       44       91     85       78
1      7       31       67     55       77
2      7       27       64     45       32
3      8       46       46     55       87
4      8        6       45     22       67
5      7       17       67     89       59

#### 4- Inserting a new row with python

In [12]:
#Adding the new row in the end
student_details.loc[len(student_details)] = ['Seth',38,7,'M','AB',78457845]

In [14]:
#displaying table after changes
student_details

    name  roll_no  class gender blood_group     phone
0    Tom       44      7      M           O    997755
1   Jake       31      7      M           A    887755
2  Kelly       27      7      F          AB    589077
3  Varun       46      8      M           O    896876
4   Adil        6      8      M           B   3404532
5  Emily       17      7      F           B    342411
6   Seth       38      7      M          AB  78457845

In [15]:
#Executing in database
student_details.to_sql("student_details",con=engine,index=False,if_exists='replace')

#### 5- Drop the table

In [22]:
#getting the connection object and cursor
conn = engine.raw_connection()
cursor = conn.cursor()

In [23]:
#Drop Command to drop table
query = "DROP TABLE IF EXISTS student_details;"

In [25]:
#Executing and commiting our command
cursor.execute(query)
conn.commit()
cursor.close()

### Notes
1- pd.read_sql(sql, con, index_col=None, coerce_float=True, params=None,    parse_dates=None, columns=None, chunksize=None) <br>
2- pd.read_sql_table : Reads SQL database table into a DataFrame.
<br>
3- pd.read_sql_query : Reads SQL query into a DataFrame.